renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_usb_basic/src/hw/r_usb_creg_access.c
/******************************************************************************
 Function Name   : hw_usb_clear_cnen
 Description     : Disable single end receiver.
 Arguments       : usb_utr_t    *ptr   : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_cnen(usb_utr_t *ptr)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
#else
        USB_M1.SYSCFG.WORD &= (~USB_CNEN);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        ptr->ipp1->SYSCFG.WORD &= (~USB_CNEN);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

}
/******************************************************************************
 End of function hw_usb_clear_cnen
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_hse
 Description     : Not processed as the functionality is provided by R8A66597(ASSP).
 Arguments       : usb_utr_t    *ptr  : Pointer to usb_utr_t structure.
  Return value    : none
 ******************************************************************************/
void hw_usb_set_hse(usb_utr_t *ptr)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
#else
        USB_M1.SYSCFG.WORD |= USB_HSE;
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        if (USB_IP1 == ptr->ip)
        {
            ptr->ipp1->SYSCFG.WORD |= USB_HSE;
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

}
/******************************************************************************
 End of function hw_usb_set_hse
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_clear_hse
 Description     : Clears HSE bit of the specified port's SYSCFG register
 Arguments       : usb_utr_t    *ptr : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_hse(usb_utr_t *ptr)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
#else
        USB_M1.SYSCFG.WORD &= (~USB_HSE);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        if (USB_IP1 == ptr->ip)
        {
            ptr->ipp->SYSCFG.WORD &= (~USB_HSE);
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

} /* End of function hw_usb_clear_hse */
/******************************************************************************
 End of function hw_usb_clear_hse
 ******************************************************************************/
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
/******************************************************************************
 Function Name   : hw_usb_set_dcfm
 Description     : DCFM-bit set of register SYSCFG
                 : (USB Host mode is selected.)
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void hw_usb_set_dcfm(void)
{
#if USB_CFG_USE_USBIP == USB_CFG_IP0
    USB_M0.SYSCFG.WORD |= USB_DCFM;
#else
    USB_M1.SYSCFG.WORD |= USB_DCFM;
#endif
}
/******************************************************************************
 End of function hw_usb_set_dcfm
 ******************************************************************************/
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */

/******************************************************************************
 Function Name   : hw_usb_clear_dcfm
 Description     : DCFM-bit clear of register SYSCFG.
                 : (USB Peripheral mode is selected.)
 Arguments       : usb_utr_t    *ptr  : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_dcfm (usb_utr_t *ptr)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        USB_M0.SYSCFG.WORD &= (~USB_DCFM);
#else
        USB_M1.SYSCFG.WORD &= (~USB_DCFM);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        ptr->ipp->SYSCFG.WORD &= (~USB_DCFM);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_clear_dcfm
 ******************************************************************************/

#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
/******************************************************************************
 Function Name   : hw_usb_clear_drpd
 Description     : Clear bit of the specified port's SYSCFG DRPD register.
                 : (for USB Host mode; Enable D + / D-line PullDown.)
 Arguments       : usb_utr_t    *ptr  : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_drpd (usb_utr_t *ptr)
{
    ptr->ipp->SYSCFG.WORD &= (~USB_DRPD);
}
/******************************************************************************
 End of function hw_usb_clear_drpd
 ******************************************************************************/
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

