renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_usb_basic/src/hw/r_usb_creg_access.c
/******************************************************************************
 Function Name   : hw_usb_set_usbe
 Description     : Enable USB operation.
 Arguments       : usb_utr_t    *ptr  : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void hw_usb_set_usbe (usb_utr_t *ptr)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        USB_M0.SYSCFG.WORD |= USB_USBE;
#else
        USB_M1.SYSCFG.WORD |= USB_USBE;
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        ptr->ipp->SYSCFG.WORD |= USB_USBE;

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_set_usbe
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_clear_usbe
 Description     : Enable USB operation.
 Arguments       : usb_utr_t    *ptr  : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_usbe (usb_utr_t *ptr)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        USB_M0.SYSCFG.WORD &= (~USB_USBE);
#else
        USB_M1.SYSCFG.WORD &= (~USB_USBE);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        ptr->ipp->SYSCFG.WORD &= (~USB_USBE);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_clear_usbe
 ******************************************************************************/

#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
/******************************************************************************
 Function Name   : hw_usb_set_buswait
 Description     : Set BUSWAIT register.
 Arguments       : usb_utr_t    *ptr  : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void hw_usb_set_buswait(usb_utr_t *ptr)
{
    ptr -> ipp1 -> BUSWAIT.WORD = (0x0f00 | USB_CFG_BUSWAIT);
}
/******************************************************************************
 End of function hw_usb_set_buswait
 ******************************************************************************/
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

/******************************************************************************
Function Name   : hw_usb_set_bcctrl
Description     : Set BCCTRL's bits.
Arguments       : usb_utr_t     *ptr   : Pointer to usb_utr_t structure.
                : uint16_t      data   : Setting value
Return value    : none
******************************************************************************/
void    hw_usb_set_bcctrl (usb_utr_t *ptr, uint16_t data)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP1
        USB_M1.BCCTRL.WORD |= data;
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        if(USB_IP1 == ptr->ip)
        {
            ptr->ipp1->BCCTRL.WORD |= data;
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_set_bcctrl
 ******************************************************************************/

/******************************************************************************
Function Name   : hw_usb_clear_bcctrl
Description     : Clear BCCTRL's bits.
Arguments       : usb_utr_t *ptr    : Pointer to usb_utr_t structure.
                : uint16_t  data    : Setting value
Return value    : none
******************************************************************************/
void    hw_usb_clear_bcctrl (usb_utr_t *ptr, uint16_t data)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP1
        USB_M1.BCCTRL.WORD &= ~data;
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        if(USB_IP1 == ptr->ip)
        {
            ptr->ipp1->BCCTRL.WORD &= ~data;
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_clear_bcctrl
 ******************************************************************************/
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

/******************************************************************************
 Function Name   : hw_usb_read_syssts
 Description     : Returns the value of the specified port's SYSSTS register.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
 Return value    : SYSSTS0 content
 ******************************************************************************/
uint16_t hw_usb_read_syssts (usb_utr_t *ptr)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        return (uint16_t)(USB_M0.SYSSTS0.WORD);
#else
        return (uint16_t)(USB_M1.SYSSTS0.WORD);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        return (uint16_t) (ptr->ipp->SYSSTS0.WORD);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
    return 0;
}
/******************************************************************************
 End of function hw_usb_read_syssts
 ******************************************************************************/

