renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_usb_basic/src/hw/r_usb_creg_access.c
/******************************************************************************
 Function Name   : hw_usb_set_dreqe
 Description     : Set DREQE-bits (to output signal DxREQ_Na) of the FIFOSEL cor-
                 : responding to specified PIPEMODE.
 Arguments       : usb_utr_t *ptr      : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
 Return value    : none
 ******************************************************************************/
void hw_usb_set_dreqe (usb_utr_t *ptr, uint16_t pipemode)
{
    volatile __evenaccess uint16_t *p_reg;

    p_reg = hw_usb_get_fifosel_adr(ptr, pipemode);

    if (true == usb_check_use_usba_module(ptr))
    {
        (*p_reg) &= (~(USB_DREQE | USB_CURPIPE));
        while(0 != ((*p_reg) & USB_CURPIPE))
        {
            /* Wait Clear CURPIPE */
        }
    }
    else
    {
        (*p_reg) &= (~USB_DREQE);
    }

    (*p_reg) |= USB_DREQE;
}
/******************************************************************************
 End of function hw_usb_set_dreqe
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_clear_dreqe
 Description     : Clear DREQE-bits (To prohibit the output of the signal DxREQ_N)
                 : of the FIFOSEL corresponding to the specified PIPEMODE.
 Arguments       : usb_utr_t *ptr      : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_dreqe (usb_utr_t *ptr, uint16_t pipemode)
{
    volatile __evenaccess uint16_t *p_reg;

    p_reg = hw_usb_get_fifosel_adr(ptr, pipemode);

    (*p_reg) &= (~USB_DREQE);
}
/******************************************************************************
 End of function hw_usb_clear_dreqe
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_mbw
 Description     : Set MBW-bits (CFIFO Port Access Bit Width) of the FIFOSEL cor-
                 : responding to the specified PIPEMODE, to select 8 or 16-bit 
                 : wide FIFO port access.
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode   : CUSE/D0DMA/D1DMA
                 : uint16_t  data       : Setting value
                 : (data = 0x0400), 32 bit (data = 0x0800) access mode.
 Return value    : none
 ******************************************************************************/
void hw_usb_set_mbw (usb_utr_t *ptr, uint16_t pipemode, uint16_t data)
{
    volatile __evenaccess uint16_t *p_reg;

    p_reg = hw_usb_get_fifosel_adr(ptr, pipemode);

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        (*p_reg) &= (~USB_MBW);
        if (0 != data)
        {
            (*p_reg) |= data;
        }

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        if (USB_IP0 == ptr->ip)
        {
            if (0 != data)
            {
                (*p_reg) |= USB_MBW_16;
            }
            else
            {
                (*p_reg) &= (~USB_MBW_16);
            }
        }
        else if (USB_IP1 == ptr->ip)
        {
            (*p_reg) &= (~USB_MBW);

            if (0 != data)
            {
                (*p_reg) |= data;
            }
        }
        else
        {
            /* None */
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_set_mbw
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_curpipe
 Description     : Set pipe to the number given; in the FIFOSEL corresponding 
                 : to specified PIPEMODE.
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode   : CUSE/D0DMA/D1DMA
                 : uint16_t  pipeno     : Pipe number.
 Return value    : none
 ******************************************************************************/
void hw_usb_set_curpipe (usb_utr_t *ptr, uint16_t pipemode, uint16_t pipeno)
{
    volatile __evenaccess uint16_t *p_reg;
    volatile __evenaccess uint16_t reg;

    p_reg = hw_usb_get_fifosel_adr(ptr, pipemode);
    reg = *p_reg;

    if ((USB_D0USE == pipemode) || (USB_D1USE == pipemode))
    {
        if (false == usb_check_use_usba_module(ptr))
        {
            reg &= (~USB_DREQE);
        }
    }

    reg &= (~USB_CURPIPE);
    *p_reg = reg;
    while (0 != ((*p_reg) & USB_CURPIPE))
    {
        /* Wait Clear CURPIPE */
    }

    reg |= pipeno;

    *p_reg = reg;
}
/******************************************************************************
 End of function hw_usb_set_curpipe
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_get_fifoctr_adr
 Description     : Returns the *address* of the FIFOCTR register corresponding to 
                 : specified PIPEMODE.
                 : (FIFO Port Control Register.)
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode   : CUSE/D0DMA/D1DMA
 Return value    : none
 ******************************************************************************/
static void *hw_usb_get_fifoctr_adr (usb_utr_t *ptr, uint16_t pipemode)
{
    void *p_reg;

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        switch (pipemode)
        {
            case USB_CUSE:
#if USB_CFG_USE_USBIP == USB_CFG_IP1
            p_reg = (void *)&(USB_M1.CFIFOCTR);

