renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_usb_basic/src/hw/r_usb_creg_access.c
/******************************************************************************
 Function Name   : hw_usb_clear_nrdyenb
 Description     : Clear the PIPExNRDYE-bit of the specified pipe to prohibit 
                 : NRDY interrupts of that pipe.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_nrdyenb (usb_utr_t *ptr, uint16_t pipeno)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        USB_M0.NRDYENB.WORD &= (1 << pipeno);
#else
        USB_M1.NRDYENB.WORD &= (1 << pipeno);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        ptr->ipp->NRDYENB.WORD &= (~(1 << pipeno));

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_clear_nrdyenb
 ******************************************************************************/

#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
/******************************************************************************
 Function Name   : hw_usb_write_bempenb
 Description     : Data is written to BEMPENB register, 
                 : enabling/disabling each respective pipe's BEMP interrupt. 
                 : (The BEMP interrupt indicates that the USB buffer is empty, 
                 : and so the FIFO can now be written to.)
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  data   : The value to write.
 Return value    : none
 ******************************************************************************/
void hw_usb_write_bempenb (usb_utr_t *ptr, uint16_t data)
{
    ptr->ipp->BEMPENB.WORD = data;
}
/******************************************************************************
 End of function hw_usb_write_bempenb
 ******************************************************************************/

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

/******************************************************************************
 Function Name   : hw_usb_set_bempenb
 Description     : A bit is set in the specified pipe's BEMPENB enabling the 
                 : respective pipe's BEMP interrupt(s).
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno  : Pipe number.
 Return value    : none
 ******************************************************************************/
void hw_usb_set_bempenb (usb_utr_t *ptr, uint16_t pipeno)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        g_usb_cstd_bemp_skip[USB_IP0][pipeno] = USB_OFF;
        USB_M0.BEMPENB.WORD |= (1 << pipeno);
#else
        g_usb_cstd_bemp_skip[USB_IP1][pipeno] = USB_OFF;
        USB_M1.BEMPENB.WORD |= (1 << pipeno);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        g_usb_cstd_bemp_skip[ptr->ip][pipeno] = USB_OFF;
        ptr->ipp->BEMPENB.WORD |= (1 << pipeno);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_set_bempenb
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_clear_bempenb
 Description     : Clear the PIPExBEMPE-bit of the specified pipe to prohibit 
                 : BEMP interrupts of that pipe.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_bempenb (usb_utr_t *ptr, uint16_t pipeno)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        USB_M0.BEMPENB.WORD &= (~(1 << pipeno));
#else
        USB_M1.BEMPENB.WORD &= (~(1 << pipeno));
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        ptr->ipp->BEMPENB.WORD &= (~(1 << pipeno));

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_clear_bempenb
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_sofcfg
 Description     : Set Bit pattern for SOFCFG
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  data  : The value to OR.
 Return value    : none
 ******************************************************************************/
void hw_usb_set_sofcfg (usb_utr_t *ptr, uint16_t data)
{
    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
#if USB_NUM_USBIP == 2
        if (USB_IP1 == ptr->ip)
        {
            ptr->ipp1->SOFCFG.WORD |= data;
        }

#endif /* USB_NUM_USBIP == 2 */
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_set_sofcfg
 ******************************************************************************/

#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
/******************************************************************************
 Function Name   : hw_usb_read_intsts
 Description     : Returns INTSTS0 register content.
 Arguments       : none
 Return value    : INTSTS0 content
 ******************************************************************************/
uint16_t hw_usb_read_intsts(void)
{
#if USB_CFG_USE_USBIP == USB_CFG_IP0
    return USB_M0.INTSTS0.WORD;
#else
    return USB_M1.INTSTS0.WORD;
#endif
}
/******************************************************************************
 End of function hw_usb_read_intsts
 ******************************************************************************/

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */

