renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_usb_basic/src/hw/r_usb_creg_access.c
/******************************************************************************
 Function Name   : hw_usb_clear_pid
 Description     : Clear the specified PID-bits of the specified pipe's DCPCTR/
                 : PIPECTR register.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number
                 : uint16_t  data  : NAK/BUF/STALL - to be cleared.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_pid (usb_utr_t *ptr, uint16_t pipeno, uint16_t data)
{
    volatile __evenaccess uint16_t *p_reg;

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        if (USB_PIPE0 == pipeno)
        {
            p_reg = ((uint16_t *)&(USB_M0.DCPCTR));
        }
        else
        {
            p_reg = ((uint16_t *)&(USB_M0.PIPE1CTR) + (pipeno - 1));
        }
#else
        if (USB_PIPE0 == pipeno)
        {
            p_reg = ((uint16_t *)&(USB_M1.DCPCTR));
        }
        else
        {
            p_reg = ((uint16_t *)&(USB_M1.PIPE1CTR) + (pipeno - 1));
        }
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        if (USB_PIPE0 == pipeno)
        {
            p_reg = ((uint16_t *) &(ptr->ipp->DCPCTR));
        }
        else
        {
            p_reg = ((uint16_t *) &(ptr->ipp->PIPE1CTR) + (pipeno - 1));
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
    (*p_reg) &= (~data);
}
/******************************************************************************
 End of function hw_usb_clear_pid
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_trenb
 Description     : The TRENB-bit (Transaction Counter Enable) is set in the speci-
                 : fied pipe's control register, to enable the counter.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number
 Return value    : none
 ******************************************************************************/
void hw_usb_set_trenb (usb_utr_t *ptr, uint16_t pipeno)
{
    volatile __evenaccess uint16_t *p_reg;

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        p_reg = (uint16_t *)&(USB_M0.PIPE1TRE) + ((pipeno - 1) * 2);
#else
        p_reg = (uint16_t *)&(USB_M1.PIPE1TRE) + ((pipeno - 1) * 2);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        p_reg = (uint16_t *) &(ptr->ipp->PIPE1TRE) + ((pipeno - 1) * 2);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

    (*p_reg) |= USB_TRENB;
}
/******************************************************************************
 End of function hw_usb_set_trenb
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_clear_trenb
 Description     : The TRENB-bit (Transaction Counter Enable) is cleared in the 
                 : specified pipe's control register, to disable the counter.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_trenb (usb_utr_t *ptr, uint16_t pipeno)
{
    volatile __evenaccess uint16_t *p_reg;

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        p_reg = (uint16_t *)&(USB_M0.PIPE1TRE) + ((pipeno - 1) * 2);
#else
        p_reg = (uint16_t *)&(USB_M1.PIPE1TRE) + ((pipeno - 1) * 2);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        p_reg = (uint16_t *) &(ptr->ipp->PIPE1TRE) + ((pipeno - 1) * 2);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

    (*p_reg) &= (~USB_TRENB);
}
/******************************************************************************
 End of function hw_usb_clear_trenb
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_trclr
 Description     : The TRENB-bit (Transaction Counter Clear) is set in the speci-
                 : fied pipe's control register to clear the current counter 
                 : value.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number
 Return value    : none
 ******************************************************************************/
void hw_usb_set_trclr (usb_utr_t *ptr, uint16_t pipeno)
{
    volatile __evenaccess uint16_t *p_reg;

    if (USB_NULL == ptr)
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        p_reg = (uint16_t *)&(USB_M0.PIPE1TRE) + ((pipeno - 1) * 2);
#else
        p_reg = (uint16_t *)&(USB_M1.PIPE1TRE) + ((pipeno - 1) * 2);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        p_reg = (uint16_t *) &(ptr->ipp->PIPE1TRE) + ((pipeno - 1) * 2);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }

    (*p_reg) |= USB_TRCLR;
}
/******************************************************************************
 End of function hw_usb_set_trclr
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_write_pipetrn
 Description     : Specified data is written to the specified pipe's PIPETRN reg-
                 : ister.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number
                 : uint16_t  data   : The value to write.
 Return value    : none
 ******************************************************************************/
void hw_usb_write_pipetrn (usb_utr_t *ptr, uint16_t pipeno, uint16_t data)
{
    volatile __evenaccess uint16_t *p_reg;

